ideas.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-03 六 12:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>画大饼</title>
<meta name="author" content="dongdigua" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' type='text/css' href='css/main.css' />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./../posts"> UP </a>
 |
 <a accesskey="H" href="https://dongdigua.github.io"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">画大饼</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a>1. 对我将来的视频网站的一些畅想</a></li>
<li><a>2. Rust wasm 制作 schemetic/litemetica 渲染器</a>
<ul>
<li><a>2.1. a vscode extension</a></li>
</ul>
</li>
<li><a>3. 用 sway 实现用窗口玩游戏(×)用游戏玩窗口(√)的效果</a></li>
<li><a>4. 不同 Linux 内核(xanmod, clear)玩 MC 性能对比</a></li>
<li><a>5. emacs mode: eww show <code>console.log()</code> in Message</a></li>
<li><a>6. win7WM</a></li>
<li><a>7. join DN42</a></li>
<li><a>8. 一个能使用 APP(key) 功能的 bili 客户端</a></li>
<li><a>9. 用 eww 实现苹果的 "灵动岛"?</a></li>
<li><a>10. Nethack x Minecraft</a></li>
</ul>
</div>
</div>
<p>
here are some of my ideas, most of which are unachieveable now<br />
you can steal them, but you'd better let me know and add a reference<br />
</p>


<div class="outline-2">
<h2><span class="section-number-2">1.</span> <a href="https://dongdigua.github.io/plan_for_my_video_site">对我将来的视频网站的一些畅想</a></h2>
</div>
<div class="outline-2">
<h2><span class="section-number-2">2.</span> Rust wasm 制作 schemetic/litemetica 渲染器</h2>
<div class="outline-text-2" id="text-2">
</div>
<div class="outline-3">
<h3><span class="section-number-3">2.1.</span> <a href="https://github.com/misode/vscode-nbt">a vscode extension</a></h3>
</div>
</div>
<div class="outline-2">
<h2><span class="section-number-2">3.</span> 用 sway 实现<a href="https://www.bilibili.com/video/BV1TE41147gK">用窗口玩游戏(×)用游戏玩窗口(√)</a>的效果</h2>
</div>
<div class="outline-2">
<h2><span class="section-number-2">4.</span> 不同 Linux 内核(xanmod, clear)玩 MC 性能对比</h2>
</div>
<div class="outline-2">
<h2><span class="section-number-2">5.</span> emacs mode: eww show <code>console.log()</code> in Message</h2>
</div>
<div class="outline-2">
<h2><span class="section-number-2">6.</span> win7WM</h2>
<div class="outline-text-2" id="text-6">
<p>
just a <a href="https://support.microsoft.com/en-us/windows/windows-7-support-ended-on-january-14-2020-b75d4580-2cc7-895a-2c9c-1466d9a53962">dream</a><br />
</p>
</div>
</div>
<div class="outline-2">
<h2><span class="section-number-2">7.</span> join DN42</h2>
</div>
<div class="outline-2">
<h2><span class="section-number-2">8.</span> 一个能使用 APP(key) 功能的 bili 客户端</h2>
<div class="outline-text-2" id="text-8">
<p>
用于点踩和查看IP属地<br />
</p>
</div>
</div>
<div class="outline-2">
<h2><span class="section-number-2">9.</span> 用 eww 实现苹果的 "灵动岛"?</h2>
<div class="outline-text-2" id="text-9">
<p>
呵呵, 在B站看到这样的基本就是壁纸软件的广告<br />
</p>
</div>
</div>
<div class="outline-2">
<h2><span class="section-number-2">10.</span> Nethack x Minecraft</h2>
</div>
</div>
<div id="postamble" class="status">

<p class="author">Author: dongdigua</p>
<p class="date">Date: 2022-09-09 五 00:00</p>
<p class="date">Build: 2022-12-03 六 12:02</p>
<p>LICENCE: CC BY-NC-SA</p>
<p>If you have any idea, please contact me! I may add your comment</p>
</div>
</body>
</html>
